Revit 2027 API
ColorFillLegend.GetColumnWidths Method
 Returns array of column widths in the legend.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<double> GetColumnWidths()
Public Function GetColumnWidths As IList(Of Double)
public:
IList<double>^ GetColumnWidths()
member GetColumnWidths : unit -> IList<float>
Return Value
IList<Double>
See Also
Reference
ColorFillLegend Class
Autodesk.Revit.DB Namespace